Revit 2026 API

# IExternalResourceUIServer Methods

---

The IExternalResourceUIServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetDBServerId | Implement this method to return the id of the server which is associated with this UI server. |
|  | GetDescription | Implement this method to return a description of the server. (Inherited from IExternalServer) |
|  | GetName | Implement this method to return the name of the server. (Inherited from IExternalServer) |
|  | GetServerId | Implement this method to return the id of the server. (Inherited from IExternalServer) |
|  | GetServiceId | Implement this method to return the id of the service. (Inherited from IExternalServer) |
|  | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from IExternalServer) |
|  | HandleBrowseResult | Implement this method to handle results from browsing external resources in the UI. It is recommended that the server only respond in the case of a critical error. |
|  | HandleLoadResourceResults |  |

#### Reference

IExternalResourceUIServer Interface

Autodesk.Revit.UI Namespace